Revit 2027 API
DimensionType.AlternateUnitsSuffix Property
 The suffix text for the alternate units value.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string AlternateUnitsSuffix { get; set; }
Public Property AlternateUnitsSuffix As String
	Get
	Set
public:
property String^ AlternateUnitsSuffix {
	String^ get ();
	void set (String^ value);
}
member AlternateUnitsSuffix : string with get, set
Property Value
String
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
DimensionType Class
Autodesk.Revit.DB Namespace